mystr1 = "abc"
mystr2 = "xyz"
print("Конкантенация :", mystr1 + mystr2)

number1 = input("Введите первое число: ")
print("Вы ввели:", number1)
number2 = input("Введите второе число: ")
print("Вы ввели:", number2)
print("Сумма строк = ", number1 + number2)
print("Сумма чисел = ", int(number1) + int(number2))


#HW Попросите пользователя ввести 3 числа.
# Выведите пользователю среднее арифметическое этих чисел.

a = input("Введите первое число")
b = input("Введите второе число")
c = input("Введите третье число")
print("Среднее арифметическое этих чисел равно:", ((int(a)+ int(b) + int(c))/3))

